Entidades/templates/nuevo.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:siiLR="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/ssii/fact/ws/SuministroLR.xsd" xmlns:sii="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/ssii/fact/ws/SuministroInformacion.xsd">
  <soapenv:Header />
  <soapenv:Body>
    <siiLR:SuministroLRFacturasEmitidas>
      <sii:Cabecera>
        <sii:IDVersionii>1.1</sii:IDVersionii>
        <sii:Titular>
          <sii:NombreRazon>Distribuciones Rosell SL</sii:NombreRazon>
          <sii:NIF>B12323648</sii:NIF>
        </sii:Titular>
        <sii:TipoComunicacion />
      </sii:Cabecera>
      <siiLR:RegistroLRFacturasEmitidas>
        <sii:PeriodoLiquidacion>
          <sii:Ejercicio>2024</sii:Ejercicio>
          <sii:Periodo>02</sii:Periodo>
        </sii:PeriodoLiquidacion>
        <siiLR:IDFactura>
          <sii:IDEmisorFactura>
            <sii:NIF>ejemplo nif</sii:NIF>
          </sii:IDEmisorFactura>
          <sii:NumSerieFacturaEmisor />
          <sii:FechaExpedicionFacturaEmisor />
        </siiLR:IDFactura>
        <siiLR:FacturaExpedida>
          <sii:TipoFactura />
          <sii:ClaveRegimenEspecialOTrascendencia />
          <sii:ImporteTotal />
          <sii:DescripcionOperacion />
          <sii:Contraparte>
            <sii:NombreRazon />
            <sii:NIF />
          </sii:Contraparte>
          <sii:TipoDesglose>
            <sii:DesgloseFactura>
              <sii:Sujeta>
                <sii:NoExenta>
                  <sii:TipoNoExenta />
                  <sii:DesgloseIVA>
                    <sii:DetalleIVA>
                      <sii:TipoImpositivo />
                      <sii:BaseImponible />
                      <sii:CuotaRepercutida />
                    </sii:DetalleIVA>
                  </sii:DesgloseIVA>
                </sii:NoExenta>
              </sii:Sujeta>
            </sii:DesgloseFactura>
          </sii:TipoDesglose>
        </siiLR:FacturaExpedida>
      </siiLR:RegistroLRFacturasEmitidas>
    </siiLR:SuministroLRFacturasEmitidas>
  </soapenv:Body>
</soapenv:Envelope>