server/templates/v_10/suministroFacturasEmitidas/consultaLRFacturasEmitidas.hbs

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:con="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/ssii/fact/ws/ConsultaLR.xsd"
 xmlns:sum="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/ssii/fact/ws/SuministroInformacion.xsd">
	<soapenv:Header/>
	<soapenv:Body>
		<con:ConsultaLRFacturasEmitidas>
			<sum:Cabecera>
				<sum:IDVersionSii>{{ cabecera.idVersion }}</sum:IDVersionSii>
				<sum:Titular>
					<sum:NombreRazon>{{ cabecera.titular.nombreRazon }}</sum:NombreRazon>
					<sum:NIF>{{ cabecera.titular.nif }}</sum:NIF>
				</sum:Titular>
			</sum:Cabecera>
			<con:FiltroConsulta>
				<sum:PeriodoImpositivo>
					<sum:Ejercicio>{{ filtroConsulta.periodoImpositivo.ejercicio }}</sum:Ejercicio>
					<sum:Periodo>{{ filtroConsulta.periodoImpositivo.periodo }}</sum:Periodo>
				</sum:PeriodoImpositivo>
				{{#if filtroConsulta.idFactura}}
				<!--Optional:-->
				<con:IDFactura>
					{{#if filtroConsulta.idFactura.numSerieFacturaEmisor}}
					<!--Optional:-->
					<sum:NumSerieFacturaEmisor>{{ filtroConsulta.idFactura.numSerieFacturaEmisor }}</sum:NumSerieFacturaEmisor>
					{{/if}} {{#if filtroConsulta.idFactura.fechaExpedicionFacturaEmisor}}
					<!--Optional:-->
					<sum:FechaExpedicionFacturaEmisor>{{ filtroConsulta.idFactura.fechaExpedicionFacturaEmisor }}</sum:FechaExpedicionFacturaEmisor>
					{{/if}}
				</con:IDFactura>
				{{/if}} {{#if filtroConsulta.contraparte}}
				<!--Optional:-->
				<con:Contraparte>
					<sum:NombreRazon>{{ filtroConsulta.contraparte.nombreRazon }}</sum:NombreRazon>
					<!--You have a CHOICE of the next 2 items at this level-->
					{{#if filtroConsulta.contraparte.nif}}
					<sum:NIF>{{ filtroConsulta.contraparte.nif }}</sum:NIF>
					{{/if}} {{#ifNot filtroConsulta.contraparte.nif}}
					<sum:IDOtro>
						{{#if filtroConsulta.contraparte.idOtro.codigoPais}}
						<!--Optional:-->
						<sum:CodigoPais>{{ filtroConsulta.contraparte.idOtro.codigoPais }}</sum:CodigoPais>
						{{/if}}
						<sum:IDType>{{ filtroConsulta.contraparte.idOtro.idType }}</sum:IDType>
						<sum:ID>{{ filtroConsulta.contraparte.idOtro.id }}</sum:ID>
					</sum:IDOtro>
					{{/ifNot}}
				</con:Contraparte>
				{{/if}} {{#if filtroConsulta.fechaPresentacion}}
				<!--Optional:-->
				<con:FechaPresentacion>
					{{#if filtroConsulta.fechaPresentacion.desde}}
					<!--Optional:-->
					<sum:Desde>{{ filtroConsulta.fechaPresentacion.desde }}</sum:Desde>
					{{/if}} {{#if filtroConsulta.fechaPresentacion.hasta}}
					<!--Optional:-->
					<sum:Hasta>{{ filtroConsulta.fechaPresentacion.hasta }}</sum:Hasta>
					{{/if}}
				</con:FechaPresentacion>
				{{/if}} {{#if filtroConsulta.facturaModificada}}
				<!--Optional:-->
				<con:FacturaModificada>{{ filtroConsulta.facturaModificada }}</con:FacturaModificada>
				{{/if}} {{#if filtroConsulta.estadoCuadre}}
				<!--Optional:-->
				<con:EstadoCuadre>{{ filtroConsulta.estadoCuadre }}</con:EstadoCuadre>
				{{/if}} {{#if filtroConsulta.clavePaginacion}}
				<!--Optional:-->
				<con:ClavePaginacion>
					<sum:IDEmisorFactura>
						<sum:NIF>{{ filtroConsulta.clavePaginacion.IDEmisorFactura.nif }}</sum:NIF>
					</sum:IDEmisorFactura>
					<sum:NumSerieFacturaEmisor>{{ filtroConsulta.clavePaginacion.numSerieFacturaEmisor }}</sum:NumSerieFacturaEmisor>
					<sum:FechaExpedicionFacturaEmisor>{{ filtroConsulta.clavePaginacion.fechaExpedicionFacturaEmisor }}</sum:FechaExpedicionFacturaEmisor>
				</con:ClavePaginacion>
				{{/if}}
			</con:FiltroConsulta>
		</con:ConsultaLRFacturasEmitidas>
	</soapenv:Body>
</soapenv:Envelope>